Revit 2026 API

# DividedPathIsIntersectorValidForDividedPath Method

---

This returns true if the intersector is an element that can be used to intersect with the divided path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsIntersectorValidForDividedPath(
	ElementId intersector
)
```
```vb
Public Function IsIntersectorValidForDividedPath (
	intersector As ElementId
) As Boolean
```
```cpp
public:
bool IsIntersectorValidForDividedPath(
	ElementId^ intersector
)
```
```fsharp
member IsIntersectorValidForDividedPath :
        intersector : ElementId -> bool
```

#### Parameters

intersector ElementId
     The intersector.

#### Return Value

Boolean True if the reference can be used to create a divided path, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Intersectors can be curve elements, datum planes, or other divided paths. Note that divided paths that have this divided path as an intersector (either directly, or recursively) are not valid. Also, if the nesting of divided path intersectors that have intersectors is more than 5 levels deep the divided path intersector is considered invalid as well.

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace